jonttu0/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
void HandsetConfigGet(uint8_t wsnum, uint8_t force=0)
{
  if (!handset_mixer_ok || !handset_adjust_ok || force) {
    // Fill MSP packet
    msp_out.reset();
    msp_out.type = MSP_PACKET_V1_ELRS;
    msp_out.flags = MSP_ELRS_INT;
    msp_out.function = ELRS_HANDSET_CONFIGS_LOAD;
    msp_out.payload[0] = 1;
    msp_out.payload[1] = 1;
    msp_out.payloadSize = 2;
    // Send packet
    MSP::sendPacket(&msp_out, &my_ctrl_serial);
    return;
  }

  delay(5);
  handleHandsetMixerResp(NULL, wsnum);
  delay(5);
  handleHandsetAdjustResp(NULL, wsnum);
}

void HandsetConfigSave(uint8_t wsnum)
{
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.function = ELRS_HANDSET_CONFIGS_SAVE;
  msp_out.payload[0] = 1;
  msp_out.payload[1] = 1;
  msp_out.payloadSize = 2;
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

void handleHandsetTlmLnkStats(uint8_t * data)
{
  String out = "ELRS_tlm_uldl=";
  LinkStatsLink_t * stats = (LinkStatsLink_t*)data;
  // Uplink
  out += "ULQ:"; out += stats->uplink_Link_quality;
  out += ",UR1:"; out += (int8_t)stats->uplink_RSSI_1;
  out += ",UR2:"; out += (int8_t)stats->uplink_RSSI_2;
  out += ",USN:"; out += (int8_t)stats->uplink_SNR;
  //out += ",PWR:"; out += stats->uplink_TX_Power;
  //out += ",MO:"; out += stats->rf_Mode;
  // Downlink
  out += ",DLQ:"; out += stats->downlink_Link_quality;
  out += ",DR1:"; out += (int8_t)(stats->downlink_RSSI - 120);
  out += ",DSN:"; out += (int8_t)stats->downlink_SNR;
  websocket_send(out);
}

void handleHandsetTlmBattery(uint8_t * data)
{
  String out = "ELRS_tlm_batt=";
  LinkStatsBatt_t * stats = (LinkStatsBatt_t*)data;
  out += "V:"; out += BYTE_SWAP_U16(stats->voltage);
  out += ",A:"; out += BYTE_SWAP_U16(stats->current);
  out += ",C:"; out += BYTE_SWAP_U32((uint32_t)stats->capacity << 8);
  out += ",R:"; out += stats->remaining;
  websocket_send(out);
}

void handleHandsetTlmGps(uint8_t * data)
{
  String out = "ELRS_tlm_gps=";
  GpsOta_t * stats = (GpsOta_t*)data;
  out += "lat:"; out += BYTE_SWAP_U32(stats->latitude);
  out += ",lon:"; out += BYTE_SWAP_U32(stats->longitude);
  out += ",spe:"; out += BYTE_SWAP_U16(stats->speed);
  out += ",hea:"; out += BYTE_SWAP_U16(stats->heading) / 10; // convert to degrees
  out += ",alt:"; out += (int)BYTE_SWAP_U16(stats->altitude) - 1000; // 1000m offset
  out += ",sat:"; out += stats->satellites;
  websocket_send(out);
}


//#define ADC_VOLT(X) (((X) * ADC_R2) / (ADC_R1 + ADC_R2))
#define ADC_SCALE (ADC_R1 / ADC_R2)

#define ADC_REF_mV  (1075U * ADC_SCALE)
#define ADC_MAX     1023U
#define ADC_VOLT(X) (((uint32_t)(X) * ADC_REF_mV) / ADC_MAX)

static uint32_t batt_voltage;
static uint32_t batt_voltage_warning_limit;
static uint32_t batt_voltage_dead_limit;

static uint32_t batt_voltage_meas_last_ms;
static uint32_t batt_voltage_warning_last_ms;
static uint32_t batt_voltage_warning_timeout = 5000;
#ifdef WS2812_PIN
static uint8_t batt_voltage_last_bright;
#endif

void battery_voltage_report(int num = -1)
{
  String out = "ELRS_handset_battery=";
  out += batt_voltage;
  out += ",";
  out += eeprom_storage.batt_voltage_scale;
  out += ",";
  out += eeprom_storage.batt_voltage_warning;

  websocket_send(out, num);
}

void battery_voltage_parse(const char * input, int num = -1)
{
  const char * temp = strstr(input, ",");
  uint32_t scale = char_u8_to_hex(input);
  if (50 <= scale && scale <= 150) {
    eeprom_storage.batt_voltage_scale = scale;
    eeprom_storage.markDirty();
  }
  if (temp) {
    scale = char_u8_to_hex(&temp[1]);
    if (10 <= scale && scale <= 100) {
      eeprom_storage.batt_voltage_warning = scale;
      eeprom_storage.markDirty();

      batt_voltage_warning_limit = ((scale * BATT_NOMINAL_mV) / 100);
    }
  }
}

void batt_voltage_init(void)
{
  batt_voltage_warning_limit =
    ((eeprom_storage.batt_voltage_warning * BATT_NOMINAL_mV) / 100);
  batt_voltage_dead_limit =
    ((BATT_DEAD_DEFAULT * BATT_NOMINAL_mV) / 100);
}

void batt_voltage_measure(void)
{
  uint32_t ms = millis();
  if (eeprom_storage.batt_voltage_interval <= (uint32_t)(ms - batt_voltage_meas_last_ms)) {
    int adc = analogRead(A0);
    batt_voltage = ADC_VOLT(adc);
    batt_voltage = (batt_voltage * eeprom_storage.batt_voltage_scale) / 100;

    battery_voltage_report();

    uint32_t brightness = (batt_voltage * 255) / BATT_NOMINAL_mV;
    if (255 < brightness) {
      batt_voltage_warning_timeout = 5000;
      brightness = 255;
    } else if (batt_voltage <= batt_voltage_dead_limit) {
      batt_voltage_warning_timeout = 500;
      brightness = 0;
    } else if (batt_voltage <= batt_voltage_warning_limit) {
      batt_voltage_warning_timeout = 500 +
        5 * (int32_t)(batt_voltage - batt_voltage_warning_limit);
      if ((int32_t)batt_voltage_warning_timeout < 500) {
        batt_voltage_warning_timeout = 500;
      }
    }

    led_brightness_set(brightness);

    batt_voltage_meas_last_ms = ms;
  }

  if (batt_voltage && (batt_voltage <= batt_voltage_warning_limit) &&
      (batt_voltage_warning_timeout <= (ms - batt_voltage_warning_last_ms))) {
#ifdef WS2812_PIN
    if (!batt_voltage_last_bright) {
      batt_voltage_last_bright = led_brightness_get();
      led_brightness_set(0, 1);
    } else {
      led_brightness_set(batt_voltage_last_bright);
      led_set();
      batt_voltage_last_bright = 0;
    }
#endif
    // 400Hz, 20ms
    beep(400, 20, 0);

    batt_voltage_warning_last_ms = ms;
  }
}

#else
#define batt_voltage_init()
#define batt_voltage_measure()
#endif

void websocket_send(char const * data, int num)
{
  if (0 <= num)
    webSocket.sendTXT(num, data);
  else
    webSocket.broadcastTXT(data);
}

void websocket_send(String & data, int num)
{
  if (!data.length())
    return;
  websocket_send(data.c_str(), num);
}

void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  char * temp;

  switch (type)
  {
  case WStype_DISCONNECTED:
    break;
  case WStype_CONNECTED:
  {
    //IPAddress ip = webSocket.remoteIP(num);
    //Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);
    //socketNumber = num;

    IPAddress my_ip;
    my_ip = (WiFi.status() == WL_CONNECTED) ? WiFi.localIP() : WiFi.softAPIP();
    String info_str = "NA";
    info_str = "My IP address = ";
    info_str += my_ip.toString();

    websocket_send(info_str, num);
    websocket_send(espnow_get_info(), num);

#if defined(LATEST_COMMIT)
    info_str = "Current version (SHA): ";
    uint8_t commit_sha[] = {LATEST_COMMIT};
    for (uint8_t iter = 0; iter < sizeof(commit_sha); iter++) {
      info_str += String(commit_sha[iter], HEX);
    }
#if LATEST_COMMIT_DIRTY
    info_str += "-dirty";
#endif
    websocket_send(info_str, num);
#endif // LATEST_COMMIT
#if WIFI_DBG
    websocket_send(wifi_log, num);
#endif

    // Send settings
    SettingsGet(num);
#if CONFIG_HANDSET
    HandsetConfigGet(num);
    delay(5);
    battery_voltage_report(num);
#endif
    break;
  }
  case WStype_TEXT:

    temp = strstr((char*)payload, "stm32_cmd=");
    if (temp) {
      // Command STM32
      if (strstr((char*)&temp[10], "reset")) {
        // Reset STM32
        reset_stm32_to_app_mode();
      }
    } else {

