jonttu0/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
#if CONFIG_HANDSET
      /* Handset specific */
      temp = strstr((char*)payload, "handset_");
      if (temp) {

        // handset_mixer=
        temp = strstr((char*)payload, "mixer=");
        if (temp) {
          temp = &temp[6];
          handleHandsetMixer(temp, (length - ((uintptr_t)temp - (uintptr_t)payload)));
          break;
        }

        // handset_calibrate=
        temp = strstr((char*)payload, "calibrate=");
        if (temp) {
          handleHandsetCalibrate(&temp[10]);
          break;
        }

        // handset_adjust_[axe]_[min|max]=val
        temp = strstr((char*)payload, "_adjust_");
        if (temp) {
          handleHandsetAdjust(&temp[8]);
          break;
        }

        temp = strstr((char*)payload, "_refresh");
        if (temp) {
          HandsetConfigGet(num, 1);
          break;
        }

        temp = strstr((char*)payload, "_save");
        if (temp) {
          HandsetConfigSave(num);
          break;
        }

        temp = strstr((char*)payload, "_battery_config=");
        if (temp) {
          battery_voltage_parse(&temp[16], num);
          break;
        }
      } else
#endif // CONFIG_HANDSET

      {
        // ExLRS setting commands
        temp = strstr((char*)payload, "S_rate");
        if (temp) {
          handleSettingRate(&temp[6], num);
          break;
        }
        temp = strstr((char*)payload, "S_power");
        if (temp) {
          handleSettingPower(&temp[7], num);
          break;
        }
        temp = strstr((char*)payload, "S_telemetry");
        if (temp) {
          handleSettingTlm(&temp[11], num);
          break;
        }
        temp = strstr((char*)payload, "S_vtx_freq");
        if (temp) {
          MspVtxWrite(&temp[10], num);
          break;
        }
        temp = strstr((char*)payload, "S_rf_pwr");
        if (temp) {
          handleSettingRfPwr(&temp[8], num);
          break;
        }
        temp = strstr((char*)payload, "S_rf_module");
        if (temp) {
          handleSettingRfModule(&temp[11], num);
          break;
        }
      }
    }
    break;
  case WStype_BIN:
    //Serial.printf("[%u] get binary length: %u\r\n", num, length);
    hexdump(payload, length);

    // echo data back to browser
    webSocket.sendBIN(num, payload, length);
    break;
  default:
    break;
  }
}


/***********************************************************************************/
/*************                    ESP OTA UPGRADE                      *************/
#define LOCAL_OTA 0
#if LOCAL_OTA
void handle_upgrade_error(void)
{
  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
    websocket_send(
      (Update.hasError()) ? "Update Failure!" : "Update Successful!");
  server.send(Update.hasError() ? 200 : 400);
}

void handleEspUpgrade(void)
{
  HTTPUpload& upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    //Serial.setDebugOutput(true);
    WiFiUDP::stopAll();
    //Serial.printf("Update: %s\n", upload.filename.c_str());
    websocket_send("*** ESP OTA ***\n  file: " + upload.filename);

    /*if (upload.name != "backpack_fw") {
      websocket_send("Invalid upload type!");
      return;
    } else*/ if (!upload.filename.startsWith("backpack.bin")) {
      websocket_send("Invalid file! Update aborted...");
      handle_upgrade_error();
      return;
    }

    uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace, U_FLASH)) { //start with max available size
      //Update.printError(Serial);
      websocket_send("File is too big!");
      handle_upgrade_error();
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      //Update.printError(Serial);
      websocket_send("Junk write failed!");
      handle_upgrade_error();
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) { //true to set the size to the current progress
      //Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      websocket_send("Update Success! Rebooting...");
    } else {
      //Update.printError(Serial);
      websocket_send("Update failed!");
    }
    //Serial.setDebugOutput(false);
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    Update.end();
  }
  delay(0); //same as yield();
}

void handleEspUpgradeFinalize(void)
{
  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
  websocket_send(
    (Update.hasError()) ? "Update Failure!" : "Update Successful!");
  server.send(Update.hasError() ? 200 : 400);
  //server.sendHeader("Connection", "close");
  //server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
  ESP.restart();
}
#endif // LOCAL_OTA

/***********************************************************************************/

void sendReturn()
{
  server.send_P(200, "text/html", GO_BACK);
}

void handle_recover()
{
  server.send_P(200, "text/html", INDEX_HTML);
}

void handleMacAddress()
{
  String message = "WiFi STA MAC: ";
  message += WiFi.macAddress();
  message += "\n  - channel in use: ";
  message += wifi_get_channel();
  message += "\n  - mode: ";
  message += (uint8_t)WiFi.getMode();
  message += "\n\nWiFi SoftAP MAC: ";
  message += WiFi.softAPmacAddress();
  message += "\n  - IP: ";
  message += WiFi.softAPIP().toString();
  message += "\n";
  server.send(200, "text/plain", message);
}

void handle_fs(void)
{
  FSInfo fs_info;
  FILESYSTEM.info(fs_info);
  String message = "FS ino: used ";
  message += fs_info.usedBytes;
  message += "/";
  message += fs_info.totalBytes;
  message += "\n**** FS files ****\n";

  Dir dir = FILESYSTEM.openDir("/");
  while (dir.next()) {
      message += dir.fileName();
      if(dir.fileSize()) {
          File f = dir.openFile("r");
          message += " - ";
          message += f.size();
          message += "B";
      }
      message += "\n";
  }

  server.send(200, "text/plain", message);
}

String getContentType(String filename)
{
  if(filename.endsWith(".html"))
    return "text/html";
  else if(filename.endsWith(".css"))
    return "text/css";
  else if(filename.endsWith(".js"))
    return "application/javascript";
  else if(filename.endsWith(".ico"))
    return "image/x-icon";
  else if(filename.endsWith(".gz"))
    return "application/x-gzip";
  return "text/plain";
}

bool handleFileRead(String path)
{
  if (path.endsWith("/"))
    // Send the index file if a folder is requested
    path += "index.html";
  // Get the MIME type
  String contentType = getContentType(path);
  uint8_t pathWithGz = FILESYSTEM.exists(path + ".gz");
  if (pathWithGz || FILESYSTEM.exists(path)) {
    if (pathWithGz)
      path += ".gz";
    File file = FILESYSTEM.open(path, "r");
    server.streamFile(file, contentType);
    file.close();
    return true;
  }
  return false;
}

/*************************************************/

enum {
  WIFI_STATE_NA = 0,
  WIFI_STATE_STA,
  WIFI_STATE_AP,
};

WiFiEventHandler stationConnectedHandler;
WiFiEventHandler stationDisconnectedHandler;
WiFiEventHandler stationGotIpAddress;
WiFiEventHandler stationDhcpTimeout;
WiFiEventHandler AP_ConnectedHandler;
WiFiEventHandler AP_DisconnectedHandler;

