jonttu0/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
static uint32_t wifi_connect_started;
static uint8_t wifi_sta_connected;

void onStationConnected(const WiFiEventStationModeConnected& evt) {
#if WIFI_DBG
  wifi_log += "Wifi_STA_connect();\n";
#endif
}

void onStationDisconnected(const WiFiEventStationModeDisconnected& evt) {
#if WIFI_DBG
  wifi_log += "Wifi_STA_diconnect();\n";
#endif
}

void onStationGotIP(const WiFiEventStationModeGotIP& evt) {
#if WIFI_DBG
  wifi_log += "Wifi_STA_GotIP();\n";
#endif
  wifi_sta_connected = WIFI_STATE_STA;
  mdns.setHostname("elrs_tx");
  if (mdns.begin("elrs_tx", WiFi.localIP())) {
    mdns.addService("http", "tcp", 80);
    mdns.addService("ws", "tcp", 81);
  }
  led_set(LED_WIFI_STA);
  /*beep(440, 30);
  delay(200);
  beep(440, 30);*/
}

void onStationDhcpTimeout(void)
{
#if WIFI_DBG
  wifi_log += "Wifi_STA_DhcpTimeout();\n";
#endif
  wifi_sta_connected = WIFI_STATE_NA;
  mdns.end();
}

void onSoftAPModeStationConnected(const WiFiEventSoftAPModeStationConnected& evt) {
  /* Client connected */
#if WIFI_DBG
  wifi_log += "Wifi_AP_connect();\n";
#endif
}

void onSoftAPModeStationDisconnected(const WiFiEventSoftAPModeStationDisconnected& evt) {
  /* Client disconnected */
#if WIFI_DBG
  wifi_log += "Wifi_AP_diconnect();\n";
#endif
}

void wifi_config(void)
{
  wifi_station_set_hostname("elrs_tx");

  wifi_sta_connected = WIFI_STATE_NA;
#if WIFI_DBG
  wifi_log = "";
#endif

#if defined(WIFI_SSID) && defined(WIFI_PSK)
  /* Force WIFI off until it is realy needed */
  WiFi.mode(WIFI_OFF);
  WiFi.forceSleepBegin();
  delay(10);
  WiFi.setAutoConnect(true);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  WiFi.disconnect(true);

  /* STA mode callbacks */
  stationConnectedHandler = WiFi.onStationModeConnected(&onStationConnected);
  stationDisconnectedHandler = WiFi.onStationModeDisconnected(&onStationDisconnected);
  stationGotIpAddress = WiFi.onStationModeGotIP(&onStationGotIP);
  stationDhcpTimeout = WiFi.onStationModeDHCPTimeout(&onStationDhcpTimeout);
  /* AP mode callbacks */
  AP_ConnectedHandler = WiFi.onSoftAPModeStationConnected(&onSoftAPModeStationConnected);
  AP_DisconnectedHandler = WiFi.onSoftAPModeStationDisconnected(&onSoftAPModeStationDisconnected);

  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PSK, WIFI_CHANNEL);
  wifi_connect_started = millis();

#elif WIFI_MANAGER
#warning "WiFi manager not supported anymore!"
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT);
  if (wifiManager.autoConnect(WIFI_AP_SSID WIFI_AP_SUFFIX)) {
    // AP found, connected
  }
#endif /* WIFI_MANAGER */

  ESP.wdtFeed();
  espnow_init(ESP_NOW_CHANNEL);
}

#define WIFI_LOOP_TIMEOUT (WIFI_TIMEOUT * 1000)
static uint32_t wifi_last_check, led_state;

void wifi_check(void)
{
  uint32_t const now = millis();
  if (WIFI_LOOP_TIMEOUT < (now - wifi_connect_started)) {
    IPAddress local_IP(192, 168, 4, 1);
    IPAddress gateway(192, 168, 4, 1);
    IPAddress subnet(255, 255, 255, 0);

    // WiFi not connected, Start access point
    WiFi.setAutoReconnect(true);
    WiFi.disconnect(true);
    WiFi.forceSleepWake();
    WiFi.mode(WIFI_AP);
    WiFi.softAPConfig(local_IP, gateway, subnet);
    WiFi.softAP(WIFI_AP_SSID WIFI_AP_SUFFIX, WIFI_AP_PSK, ESP_NOW_CHANNEL,
                WIFI_AP_HIDDEN, WIFI_AP_MAX_CONN);
    wifi_sta_connected = WIFI_STATE_AP;
#if WIFI_DBG
    wifi_log += "WifiAP started\n";
#endif
    led_set(LED_WIFI_AP);
    beep(400, 20);
  } else if (500 <= (now - wifi_last_check)) {
    wifi_last_check = now;
    /* Blink led */
    led_set(led_state ? LED_WIFI_AP : LED_OFF);
    led_state ^= 1;
  }
}

void wifi_config_server(void)
{
  server.on("/fs", handle_fs);
  server.on("/return", sendReturn);
  server.on("/mac", handleMacAddress);
#if LOCAL_OTA
  server.on("/update_tst", HTTP_POST, // ESP OTA upgrade
    handleEspUpgradeFinalize, handleEspUpgrade);
#endif // LOCAL_OTA
  server.on("/upload", HTTP_POST, // STM32 OTA upgrade
    stm32_ota_handleFileUploadEnd, stm32_ota_handleFileUpload);
  server.onNotFound([]() {
    if (!handleFileRead(server.uri())) {
      // No matching file, respond with a 404 (Not Found) error
      //server.send(404, "text/plain", "404: Not Found");
      handle_recover();
    }
  });

  httpUpdater.setup(&server);
  server.begin();

  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
}


void setup()
{
  //ESP.eraseConfig();

  msp_handler.markPacketFree();

  eeprom_storage.setup();

  /* Reset values */
  settings_rate = 1;
  settings_power = 4;
  settings_power_max = 8;
  settings_tlm = 7;
  settings_region = 255;
  settings_valid = 0;
#if CONFIG_HANDSET
  handset_num_switches = 6;
  handset_num_aux = 5;
  handset_mixer_ok = 0;
  handset_adjust_ok = 0;
  batt_voltage = 0;
  batt_voltage_warning_last_ms = millis();
#endif

#ifdef BUZZER_PIN
  pinMode(BUZZER_PIN, OUTPUT);
#endif

  //Serial.setRxBufferSize(256);
#ifdef INVERTED_SERIAL
  // inverted serial
  Serial.begin(SERIAL_BAUD, SERIAL_8N1, SERIAL_FULL, 1, true);
#else
  // non-inverted serial
  Serial.begin(SERIAL_BAUD);
#endif

  led_init();
  led_set(LED_INIT);
  batt_voltage_init();

#if (BOOT0_PIN == 2 || BOOT0_PIN == 0)
  reset_stm32_to_app_mode();
#endif

  FILESYSTEM.begin();
  //FILESYSTEM.format();

  wifi_config();
  wifi_config_server();

  // wsnum does not matter because settings_valid == false
  SettingsGet(0);
}


int serialEvent()
{
  int temp;
  uint8_t inChar;
  while (Serial.available()) {
    temp = Serial.read();
    if (temp < 0)
      break;

    inChar = (uint8_t)temp;
    if (msp_handler.processReceivedByte(inChar)) {
      uint8_t forward = true;
      String info = "MSP received: ";
      // msp fully received
      mspPacket_t &msp_in = msp_handler.getPacket();
      if (msp_in.type == MSP_PACKET_V1_ELRS) {
        uint8_t * payload = (uint8_t*)msp_in.payload;
        switch (msp_in.function) {
          case ELRS_INT_MSP_PARAMS: {
            info += "ELRS params";
            settings_rate = payload[0];
            settings_tlm = payload[1];
            settings_power = payload[2];
            settings_power_max = payload[3];
            settings_region = payload[4];
            settings_valid = 1;

