jonttu0/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
#if 0
            if (settings_region != 255) {
              if (3 <= settings_region)
                led_set(LED_FREQ_2400);
              else
                led_set(LED_FREQ_900);
            }
#endif

            handleSettingDomain(NULL);
            handleSettingRate(NULL);
            handleSettingPower(NULL);
            handleSettingTlm(NULL);
            break;
          }
#if CONFIG_HANDSET
          case ELRS_HANDSET_CALIBRATE: {
            info += "CALIBRATE error";
            handleHandsetCalibrateResp(payload);
            break;
          }
          case ELRS_HANDSET_MIXER: {
            info += "MIXER config";
            handleHandsetMixerResp(payload);
            handset_mixer_ok = 1;
            break;
          }
          case ELRS_HANDSET_ADJUST: {
            info += "ADJUST config";
            handleHandsetAdjustResp(payload);
            handset_adjust_ok = 1;
            break;
          }
          case ELRS_HANDSET_TLM_LINK_STATS: {
            info = "";
            forward = false;
            handleHandsetTlmLnkStats(payload);
            break;
          }
          case ELRS_HANDSET_TLM_BATTERY: {
            info = "";
            forward = false;
            handleHandsetTlmBattery(payload);
            break;
          }
          case ELRS_HANDSET_TLM_GPS: {
            info = "";
            forward = false;
            handleHandsetTlmGps(payload);
            break;
          }
#endif /* CONFIG_HANDSET */
          default:
            info += "UNKNOWN";
            forward = false;
            break;
        };
      }

      if (info.length())
        websocket_send(info);
      if (forward)
        espnow_send_msp(msp_in);

      msp_handler.markPacketFree();
    } else if (!msp_handler.mspOngoing()) {
      if (inChar == '\r') {
        continue;
      } else if (inChar == '\n' || 64 <= inputString.length()) {
        return 0;
      }
      if (isprint(inChar))
        inputString += (char)inChar;
    }

    //if (msp_handler.error())
    //  msp_handler.markPacketFree();
  }
  return -1;
}


void loop()
{
  if (wifi_sta_connected == WIFI_STATE_NA)
    wifi_check();

  ESP.wdtFeed();

  if (0 <= serialEvent()) {
    websocket_send(inputString);
    inputString = "";
  }
  ESP.wdtFeed();

  server.handleClient();
  webSocket.loop();
  mdns.update();

  batt_voltage_measure();

  if (msp_send_save_requested_ms &&
      (MSP_SAVE_DELAY_MS <= (millis() - msp_send_save_requested_ms))) {
    /* Save send requested, send and clear the flag */
    msp_out.reset();
    msp_out.type = MSP_PACKET_V1_CMD;
    msp_out.flags = MSP_VERSION | MSP_STARTFLAG;
    msp_out.function = MSP_EEPROM_WRITE;
    msp_out.payloadSize = 0; // No params
    MSP::sendPacket(&msp_out, &my_ctrl_serial);

    msp_send_save_requested_ms = 0;
  }

  eeprom_storage.update();
}
